Revit 2024 API
NumberingSchemaType Class
 A type for identifying a NumberingSchema of a particular kind.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class NumberingSchemaType : GuidEnum
Visual Basic
Public Class NumberingSchemaType _
	Inherits GuidEnum
Visual C++
public ref class NumberingSchemaType : public GuidEnum
Remarks
Each numbering schema is applicable to a certain category of Revit elements. For example, the Rebar numbering schema (built-in) is used and only applicable to Rebar elements. With that schema present, all Rebar elements automatically will get their respective numbers and those numbers would not correspond in any way to numbers of other enumerable elements that belong to different numbering schemas.
There are only built-in schemas available currently.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.DB.NumberingSchemaType
See Also
NumberingSchemaType Members
Autodesk.Revit.DB Namespace